app/controllers/api/article/articles_controller.rb

DELETE FROM "article_contents" WHERE "article_contents"."id" = $1  [["id", 8]]
---
    def destroy
        begin
            article = ::Article::Main.find(params[:id])
            if article
                content = ::Article::Content.find(article.content_id)
                content.destroy!

INSERT INTO "article_contents" ("no", "created_at", "updated_at", "htmlcontent") VALUES ($1, $2, $3, $4) RETURNING "id"  [["no", "WZ2018012200003"], ["created_at", "2018-01-22 08:57:59.310249"], ["updated_at", "2018-01-22 08:57:59.310249"], ["htmlcontent", "<p><span style=\"color:#003ba5;\">asdfasdf</span></p>"]]
INSERT INTO "article_mains" ("title", "author", "author_id", "content_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "文章"], ["author", "Link"], ["author_id", "3"], ["content_id", 8], ["created_at", "2018-01-23 03:35:15.722009"], ["updated_at", "2018-01-23 03:35:15.722009"]]
---
    def create
        begin
            ::Article::Main.transaction do
                content = ::Article::Content.new
                content.content = params[:content]
                content.htmlcontent = params[:content][:htmlcontent]
                content.no = Utils::Redis.get_code_length_year(5,"WZZW")
                content.save!
                article_main = ::Article::Main.new(article_params)
                article_main.no = Utils::Redis.get_code_length_year(5,"WZ")
                article_main.content_id = content.id
                article_main.author = current_user.username
                article_main.author_id = current_user.id
                article_main.save!