app/controllers/api/admin/sessions_controller.rb

INSERT INTO "admin_user_logs" ("ip", "user_id", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ip", "127.0.0.1"], ["user_id", 1], ["username", "admin"], ["created_at", "2017-12-14 05:11:11.613698"], ["updated_at", "2017-12-14 05:11:11.613698"]]
---
    def create
        @user = ::Admin::User.find_by(:account => session_params[:account])
        api_error({:message => "用户不存在",:code => 1}) && return if @user.blank?
        # api_error({:message => "密码错误", :code => 1}) && return if @user.password(session_params[:password])
        api_error({:message => "密码错误", :code => 1}) && return if @user.password != session_params[:password]
        api_error({:message => "用户已冻结", :code => 1}) && return if @user.state == 2
        if SessionCreateService.call(@user,{})
            # 记录登录日志
            ::Admin::UserLog.create({:user_id => @user.id, :username => @user.username, :ip => request.remote_ip})