app/controllers/api/admin/users_controller.rb

DELETE FROM "admin_users" WHERE "admin_users"."id" = $1  [["id", 8]]
---
    def destroy
        begin
            @user = ::Admin::User.find(params[:id])
            if @user
                ::Admin::User.transaction do
                    @user.destroy!

INSERT INTO "admin_users" ("code", "username", "account", "password_hash", "state", "created_at", "updated_at", "authentication_token", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        account = params[:user][:account]
        if account.present?
            # 验证手机号/邮箱是否已注册
            existUser = ::Admin::User.find_by(:account => account)
            api_error({:message => '用户名已存在',:code => 1}) && return if existUser.present?
            # 新建用户
            user = ::Admin::User.new(user_params)
            # 存储密文密码
            user.password = params[:user][:password]
            user.avatar = "http://localhost:3000/uploads/avatar/" + avatar_params
            user.code = Utils::Redis.get_code_length_year(5,"YH")
            user.state = 0
            begin
                ::Admin::User.transaction do
                    user.save!